{"expireTime":9007200847410730000,"key":"transformer-remark-markdown-html-9c11f9011f9c3ea11bb030bec51c8a12-gatsby-remark-relative-imagesgatsby-remark-katexgatsby-remark-imagesgatsby-remark-responsive-iframegatsby-remark-autolink-headersgatsby-remark-prismjsgatsby-remark-copy-linked-filesgatsby-remark-smartypantsgatsby-remark-external-links-","val":"<p>Today I want to tell you my experience using these <strong>two operating systems</strong>, from the point of view of a <strong>developer</strong> but also of a <strong>normal user</strong>, because I use the PC both at work and at home, both to program and to reply to emails, write documents, mark appointments etc…</p>\n<p>During my <strong>ten years of programming</strong> I have had the opportunity to use <strong>both Windows and Mac</strong>, each for several years, and I have come to my conclusion.</p>\n<p><img src=\"https://www.albertoreineri.it/wp-content/uploads/2019/12/1569341625-mac-vs-windows-competition.png\" alt=\"Windows VS Mac Web Deveopment\"></p>\n<h2 id=\"my-early-years\" style=\"position:relative;\"><a href=\"#my-early-years\" aria-label=\"my early years permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>My early years</h2>\n<p>I started my career as a <strong>vb.net</strong> programmer, so I was necessarily using a <strong>Windows pc</strong>. It was an old half-broken Windows xp machine. I have to say I wasn’t feeling bad at all. By developing management software, customers in 99.9% of cases had a windows pc (at the time there were very few apple products around in Italy) and therefore the program had to run on that operating system. Those first four years of programming made me appreciate the good Bill Gates’s operating system, getting to know practically all the keyboard shortcuts and all the customizations available, I was able to be really fast with my PC and I knew my environment perfectly.</p>\n<h2 id=\"macbook-white\" style=\"position:relative;\"><a href=\"#macbook-white\" aria-label=\"macbook white permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Macbook White</h2>\n<p>Then, mostly out of curiosity, <strong>I bought myself a Mac</strong>, in particular the unibody macbook white. Very beautifull!</p>\n<p>Aesthetically it had no comparison with the competition. A <strong>completely white pc</strong>, without drawings, stencils, without anything superfluous.</p>\n<p>Thus began my journey into the Apple world. And it went well.</p>\n<p>From the design point of view Mac won hands down, also had a program that I loved and used a lot: <strong>Garageband</strong>!</p>\n<p>The simplicity of that software was great! I could record in a decent way even without a sound card, without lag of any kind, and the effects already present by default were fantastic! I’ve never found anything like this in Windows unfortunately …</p>\n<p>But there was always <strong>something wrong with me</strong>…</p>\n<p>It was beautiful, the battery was infinite, it was fluid and fast, but <strong>too closed</strong>!</p>\n<p>It will also be obvious, but I really didn’t like being inside of closed system!</p>\n<p><strong>I’ve always been a geek</strong>. As soon as I take a machine of any type in my hands I have to understand how it works, how to make it work better and how to hack it a little, and with the mac I could not do much …</p>\n<h2 id=\"my-problems-with-mac-os\" style=\"position:relative;\"><a href=\"#my-problems-with-mac-os\" aria-label=\"my problems with mac os permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>My problems with Mac OS</h2>\n<p>The first problem was the <strong>Office suite</strong>. At the time the only alternative was Open Office, but the compatibility was not 100%, sometimes it happened to open a Word file and see the formatting completely unpacked… And this annoyed me a lot. Of course I could have bought Office for Mac, but I didn’t…</p>\n<p>Then on the programming side I felt a bit stuck. It is true that <strong>Visual Basic</strong> is a very basic language, but at the time I knew and I could not do anything with my PC. I had installed windows on a virtual machine but it was very very slow and I could not work properly …</p>\n<p>Web development was also not that simple for me! I used <strong>XAMPP</strong> and at the time I remember it wasn’t there for Mac, so I downloaded MAMP but I didn’t like it very much …</p>\n<p>Finally I couldn’t play it … and although I have never been a hardened gamer, every now and then I could throw a few simple games to relax for a moment was not bad.</p>\n<p>Let’s say <strong>I felt stuck</strong>. If with Windows I could do everything I wanted, install everything, modify, try until I had to format the computer because of all the mess I had created, with the Mac I could not do almost anything … Of course I avoided creating mess, but I liked!!!</p>\n<h2 id=\"back-to-windows\" style=\"position:relative;\"><a href=\"#back-to-windows\" aria-label=\"back to windows permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Back to Windows</h2>\n<p>After 6 years I had to change the pc, the small white macbook was really fed up, and <strong>I went back to Windows</strong>.</p>\n<p>Today the <strong>prices</strong> of the Macs are really unaviceable … My white macbook started from a price of 1000 € and I remember having it on offer at 800 €.</p>\n<p>Now if you want a basic model you have to pull out almost double, to have 128Gb of memory, truly a ridiculous cut, and without having available USB, SD and HDMI ports, which I still find of fundamental importance.</p>\n<p>So <strong>I took Windows back and I have to say that I’m having a great time</strong>!</p>\n<p>I can really do anything! I immediately started messing around again and after two weeks I already had to format the pc because I had installed a lot of stupid things, but I was happy! This is how I like to live the PC, I want to be the one who decides how to make it work!</p>\n<p>Now I can program, record music, play games, write, edit videos, use virtual machines etc. without slowing down. Spending less than a Macbook I took a Core i7 with 16Gb of RAM, 128Gb of SSD and 1Tb of HDD and 4Gb of video card! Basically a bomb, spending less than 1000 € !!!</p>\n<p>There are only <strong>two things I can’t use with Windows</strong>: the aforementioned Garageband and XCode. Of course this precludes the possibility of developing ios apps, but at the moment I don’t work in that area so I don’t particularly care!</p>\n<p>For everything else, I’m really happy! I can spend the day programming, using text editors, chrome with the usual thousand tabs open, photoshop, figma, XAMPP and all the programs I need and everything runs perfectly! Also, if I want to take a short break and play a few games, I can upload them without any problem, without even having to worry about closing photoshop!</p>\n<h2 id=\"conclusion\" style=\"position:relative;\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>This has been <strong>my story with these operating systems</strong>! Of course, perfection does not exist and you can always find better, but for the moment I am happy with my Windows notebook.</p>\n<p>If I didn’t have to pay attention to the money then I would certainly favor a <strong>Macbook pro</strong> with 512 SSD for developing, and then a nice fixed PC for everything else, so as to have a clean and dedicated machine for development and the other to do the my experiments, but not having the possibility to spend 5000 € on computers I chose a versatile machine, which allows me to do a little bit of everything I want!</p>\n<h2 id=\"the-third-enjoys-the-two-litigants-linux\" style=\"position:relative;\"><a href=\"#the-third-enjoys-the-two-litigants-linux\" aria-label=\"the third enjoys the two litigants linux permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The third enjoys the two litigants: LINUX!!!</h2>\n<p>I want to end this article by citing the perfect solution for geeks like me: Linux! <strong>I have always loved Ubuntu</strong> and still use it in a virtual machine, together with Manjaro (I have not yet understood which I prefer …), but I have not yet had the courage to install it instead of windows. The biggest problem is the <strong>Adobe suite</strong>, which I use every day and which I still cannot do without. If it were not for this I think I would have already <strong>gone to the Penguin</strong> for some time!</p>\n<hr>\n<h2 id=\"2020-update\" style=\"position:relative;\"><a href=\"#2020-update\" aria-label=\"2020 update permalink\" class=\"anchor before\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>2020 Update</h2>\n<p>My job is going well and i purchased the new Macbook Pro 2020 Base model! Never been so happy!\nNow i can develop on an Unix based system, create my design and manage all my work stuff with the Mac, and play games, enjoy distro and hack with the old Windows laptop. The best situation for me!</p>\n<p><em>Hope you enjoy this story.</em></p>\n<p>It’s my first English post, please be patience for grammar error…</p>"}